BRB_Documentation/docs/SOAP/20130823_AccountApplication SOAP Test.txt

--Account Application Request for BRB


<soapenv:Envelope
    xmlns:soapenc = "http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd = "http://www.w3.org/2001/XMLSchema"
    xmlns:xsi = "http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <p282:MessageHeader xmlns:p282 = "http://www.ctc.ctfs.channel.com/WebICGateway/">
            <messageHeader>
                <secureContentFlag>1</secureContentFlag>
                <messageType>ACCOUNT_APPLICATION</messageType>
                <responseMode>Synchronous</responseMode>
                <messageId>1</messageId>
                <correlationId>1234</correlationId>
            </messageHeader>
        </p282:MessageHeader>
    </soapenv:Header>
    <soapenv:Body>
                <p282:RequestBody xmlns:p282="http://www.ctc.ctfs.channel.com/WebICGateway/">
                    <RequestBody>
<![CDATA[
<AccountApplicationRequest>
  <externalReferenceId>1377197161239</externalReferenceId>
  <storeNumber>0500</storeNumber>
  <agentId>MQSYS</agentId>
  <channelIndicator>WP</channelIndicator>
  <agencyPromoCode></agencyPromoCode>
  <acquistionStrategyCode>0e5577</acquistionStrategyCode>
  <requestedProductType>OMP</requestedProductType>
  <firstName>BREDITU</firstName>
  <lastName>PERIWINKLE</lastName>
  <middleInitial></middleInitial>
  <dateOfBirth>1970-04-17</dateOfBirth>
  <sin></sin>
  <idType>DR</idType>
  <idNumber>1234124</idNumber>
  <placeOfIssue>AB</placeOfIssue>
  <preferedLanguage>E</preferedLanguage>
  <applicantGender>M</applicantGender>
  <currentAddressType>M</currentAddressType>
  <currentAddressLine1>1 LEACOCK COURT</currentAddressLine1>
  <currentAddressLine2></currentAddressLine2>
  <currentCity>DARTMOUTH</currentCity>
  <currentProvince>NS</currentProvince>
  <currentPostalCode>B2W4J4</currentPostalCode>
  <currentCountry>CA</currentCountry>
  <currentTelephoneNumber>4039674216</currentTelephoneNumber>
  <currentCellPhoneNumber></currentCellPhoneNumber>
  <yearsAtCurrentAddress>10</yearsAtCurrentAddress>
  <monthsAtCurrentAddress>1</monthsAtCurrentAddress>
  <currentEmailAddress></currentEmailAddress>
  <previousAddressLine1> </previousAddressLine1>
  <previousAddressLine2></previousAddressLine2>
  <previousCity></previousCity>
  <previousPostalCode></previousPostalCode>
  <previousCountry>CA</previousCountry>
  <employementStatus>F</employementStatus>
  <jobTitle>MANAGER</jobTitle>
  <employementCategory>MA</employementCategory>
  <employerName>YEPTEL</employerName>
  <employerTelephoneNumber>2222222243</employerTelephoneNumber>
  <yearsAtEmployement>10</yearsAtEmployement>
  <monthsAtEmployement>1</monthsAtEmployement>
  <grossAnnualIncome>99999</grossAnnualIncome>
  <monthlyRentMortgageAmount>0</monthlyRentMortgageAmount>
  <bankCardFlag>N</bankCardFlag>
  <bankLoanFlag>N</bankLoanFlag>
  <chequingAccountFlag>N</chequingAccountFlag>
  <savingsAccountFlag>N</savingsAccountFlag>
  <storeCardFlag>N</storeCardFlag>
  <gasCardFlag>N</gasCardFlag>
  <supp1Country>CA</supp1Country>
  <agreedToTermsFlag>Y</agreedToTermsFlag>
  <applicantSignature>iVBORw0KGgoAAAANSUhEUgAAAiwAAACLCAYAAABC8cKWAAAZKklEQVR4Xu2dbaxlVXnH9545zIAV
B1CpJlRKSSOtrUBNjG0xDh/amhQLKImhNWUMTaxoAqNzBugXLk0amLtvHWyCtakThw9Sm0gFbZq+
fOCSVhL7RSk1dJImXkLsi1hheHGAucPpf+2z975rn/ty9jlnv6y19m/HnZk5d++1n+f37Mv5+6xn
PSuOOCAAAQhAAAIQgIDjBGLH7cM8CEAAAhCAAAQgECFYeAkgAAEIQAACEHCeAILF+RBhIAQgAAEI
BCDgDgEEizuxwJJWCSxfoTqVb+uRWi2UHo/pVF+WwXGESquB4GEQgAAEKhFAsFTCxEUQgAAEIAAB
CHRJAMHSJX2eDQEIQAACEIBAJQIIlkqYuAgCEIAABCAAgS4J/D/gMdXXfHEqUAAAAABJRU5ErkJg
gg==</applicantSignature>
  <signatureFlag>Y</signatureFlag>
  <signatureMatchFlag>Y</signatureMatchFlag>
  <dateSigned >2013-05-29</dateSigned>
<tuSessionId>1225683</tuSessionId>
<tuExamResult>PASSED</tuExamResult>
<emailConsentFlag>Y</emailConsentFlag>
<insuranceAgreedFlag>N</insuranceAgreedFlag>
  <insuranceCode>N</insuranceCode>
  <roadsideOnRequestFlag>N</roadsideOnRequestFlag>
</AccountApplicationRequest>
]]>
                    
                    </RequestBody>
                </p282:RequestBody>
    </soapenv:Body>
</soapenv:Envelope>


--Account Application Response for BRB

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <p309:MessageHeader xmlns:p309="http://www.ctc.ctfs.channel.com/WebICGateway/">
         <messageHeader>
            <secureContentFlag>1</secureContentFlag>
            <messageType>ACCOUNT_APPLICATION</messageType>
            <responseMode>Synchronous</responseMode>
            <messageId>1</messageId>
            <correlationId>1234</correlationId>
         </messageHeader>
      </p309:MessageHeader>
   </soapenv:Header>
   <soapenv:Body>
      <p309:ResponseBody xmlns:p309="http://www.ctc.ctfs.channel.com/WebICGateway/">
         <ResponseBody>
            <requestStatus>Success</requestStatus>
            <resultDocument>&lt;?xml version="1.0" encoding="UTF-8"?> &lt;tns:AccountApplicationResponse>  &lt;tns:appStatus>PENDING&lt;/tns:appStatus>&lt;/tns:AccountApplicationResponse></resultDocument>
         </ResponseBody>
      </p309:ResponseBody>
   </soapenv:Body>
</soapenv:Envelope>
