BRB_Documentation/docs/SOAP/20130821_Failure Soap Scoring Test %28Ottawa%29.txt

--Exam Request

<soapenv:Envelope
    xmlns:soapenc = "http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd = "http://www.w3.org/2001/XMLSchema"
    xmlns:xsi = "http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <p282:MessageHeader xmlns:p282 = "http://www.ctc.ctfs.channel.com/WebICGateway/">
            <messageHeader>
                <secureContentFlag>1</secureContentFlag>
                <messageType>TU_AUTHENTICATION_EXAM_IDENTITY</messageType>
                <responseMode>Synchronous</responseMode>
                <messageId>1</messageId>
                <correlationId>1234</correlationId>
            </messageHeader>
        </p282:MessageHeader>
    </soapenv:Header>
               <soapenv:Body>
<p282:RequestBody xmlns:p282="http://www.ctc.ctfs.channel.com/WebICGateway/">
<RequestBody>&lt;WebICIdentityExamRequest&gt;
&lt;firstName&gt;BREDITU&lt;/firstName&gt;
&lt;middleName&gt;&lt;/middleName&gt;
&lt;lastName&gt;Zephyranth&lt;/lastName&gt;
&lt;channel&gt;WEBIC&lt;/channel&gt;
&lt;driversLicense&gt;&lt;/driversLicense&gt;
&lt;driversLicenseExpirationDate&gt;&lt;/driversLicenseExpirationDate&gt;
&lt;phoneNumber&gt;&lt;/phoneNumber&gt;
&lt;dateOfBirth&gt;07/18/1976&lt;/dateOfBirth&gt;
&lt;address&gt;
&lt;addressLine1&gt;203 180 METCALFE ST&lt;/addressLine1&gt;
&lt;addressLine2&gt;&lt;/addressLine2&gt;
&lt;addressLine3&gt;&lt;/addressLine3&gt;
&lt;city&gt;OTTAWA&lt;/city&gt;
&lt;province&gt;ON&lt;/province&gt;
&lt;postalCode&gt;K2P1P5&lt;/postalCode&gt;
&lt;/address&gt;
&lt;/WebICIdentityExamRequest&gt;
</RequestBody>
</p282:RequestBody>
</soapenv:Body>
</soapenv:Envelope>


--Exam Response

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <p309:MessageHeader xmlns:p309="http://www.ctc.ctfs.channel.com/WebICGateway/">
         <messageHeader>
            <secureContentFlag>1</secureContentFlag>
            <messageType>TU_AUTHENTICATION_EXAM_IDENTITY</messageType>
            <responseMode>Synchronous</responseMode>
            <messageId>1</messageId>
            <correlationId>1234</correlationId>
         </messageHeader>
      </p309:MessageHeader>
   </soapenv:Header>
   <soapenv:Body>
      <p309:ResponseBody xmlns:p309="http://www.ctc.ctfs.channel.com/WebICGateway/">
         <ResponseBody>
            <requestStatus>Success</requestStatus>
            <resultDocument><![CDATA[<?xml version="1.0" encoding="UTF-8"?> 
<WebICIdentityExamResponse>
    <identityExam>
        <id>1224615</id>
        <transactionId>1377100642043</transactionId>
        <score>0.00000</score>
        <state>issued</state>
        <questions>
            <question>
                <id>150</id>
                <text>IN THE PAST 5 YEARS, WHICH PROVINCE HAVE YOU LIVED IN?</text>
                <state>un-scored</state>
                <maxTimeToAnswer>45</maxTimeToAnswer>
                <possibleAnswers>
                    <answer>
                        <id>0</id>
                        <text>ONTARIO</text>
                    </answer>
                    <answer>
                        <id>1</id>
                        <text>BRITISH COLUMBIA</text>
                    </answer>
                    <answer>
                        <id>2</id>
                        <text>NONE OF THE ABOVE</text>
                    </answer>
                </possibleAnswers>
            </question>
            <question>
                <id>148</id>
                <text>FROM THE FOLLOWING LIST, SELECT ONE OF YOUR PREVIOUS ADDRESSES.</text>
                <state>un-scored</state>
                <maxTimeToAnswer>45</maxTimeToAnswer>
                <possibleAnswers>
                    <answer>
                        <id>0</id>
                        <text>32 IRVING</text>
                    </answer>
                    <answer>
                        <id>1</id>
                        <text>16604 102A</text>
                    </answer>
                    <answer>
                        <id>2</id>
                        <text>NONE OF THE ABOVE</text>
                    </answer>
                </possibleAnswers>
            </question>
            <question>
                <id>151</id>
                <text>IN 2013, YOU LIVED IN WHICH OF THE FOLLOWING CITIES?</text>
                <state>un-scored</state>
                <maxTimeToAnswer>120</maxTimeToAnswer>
                <possibleAnswers>
                    <answer>
                        <id>0</id>
                        <text>GODERICH</text>
                    </answer>
                    <answer>
                        <id>1</id>
                        <text>WELLAND</text>
                    </answer>
                    <answer>
                        <id>2</id>
                        <text>NONE OF THE ABOVE</text>
                    </answer>
                </possibleAnswers>
            </question>
        </questions>
    </identityExam>
</WebICIdentityExamResponse>
]]></resultDocument>
         </ResponseBody>
      </p309:ResponseBody>
   </soapenv:Body>
</soapenv:Envelope>


--Scoring Request

<soapenv:Envelope
    xmlns:soapenc = "http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd = "http://www.w3.org/2001/XMLSchema"
    xmlns:xsi = "http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <p282:MessageHeader xmlns:p282 = "http://www.ctc.ctfs.channel.com/WebICGateway/">
            <messageHeader>
                <secureContentFlag>1</secureContentFlag>
                <messageType>TU_AUTHENTICATION_EXAM_IDENTITY</messageType>
                <responseMode>Synchronous</responseMode>
                <messageId>1</messageId>
                <correlationId>1234</correlationId>
            </messageHeader>
        </p282:MessageHeader>
    </soapenv:Header>
    <soapenv:Body>
	<p282:RequestBody xmlns:p282="http://www.ctc.ctfs.channel.com/WebICGateway/">
	    <RequestBody>&lt;WebICScoreIdentityExamRequest&gt;
&lt;identityExam&gt; 
&lt;id&gt;1224615&lt;/id&gt;
&lt;channel&gt;WEBIC&lt;/channel&gt;
&lt;transactionId&gt;1377100642043&lt;/transactionId&gt;
&lt;score&gt;0.00000&lt;/score&gt;
&lt;state&gt;issued&lt;/state&gt;
&lt;questions&gt;
	&lt;question&gt;
		&lt;id&gt;150&lt;/id&gt;
		&lt;text&gt;IN THE PAST 5 YEARS, WHICH PROVINCE HAVE YOU LIVED IN?&lt;/text&gt;
		&lt;state&gt;un-scored&lt;/state&gt;
		&lt;maxTimeToAnswer&gt;45&lt;/maxTimeToAnswer&gt;
		&lt;answerId&gt;1&lt;/answerId&gt;
	    &lt;possibleAnswers&gt;          
			 &lt;answer&gt;            
					 &lt;id&gt;0&lt;/id&gt;            
					 &lt;text&gt;ONTARIO&lt;/text&gt;          
			 &lt;/answer&gt;          
			 &lt;answer&gt;            
					 &lt;id&gt;1&lt;/id&gt;            
					 &lt;text&gt;BRITISH COLUMBIA&lt;/text&gt;          
			 &lt;/answer&gt;          
			 &lt;answer&gt;            
					 &lt;id&gt;2&lt;/id&gt;            
					 &lt;text&gt;NONE OF THE ABOVE&lt;/text&gt;          
			 &lt;/answer&gt;        
	   &lt;/possibleAnswers&gt;
	&lt;/question&gt;
	&lt;question&gt;
		&lt;id&gt;148&lt;/id&gt;
		&lt;text&gt;FROM THE FOLLOWING LIST, SELECT ONE OF YOUR PREVIOUS ADDRESSES.&lt;/text&gt;
		&lt;state&gt;un-scored&lt;/state&gt;
		&lt;maxTimeToAnswer&gt;45&lt;/maxTimeToAnswer&gt;
		&lt;answerId&gt;1&lt;/answerId&gt;
	    &lt;possibleAnswers&gt;          
			&lt;answer&gt;            
					&lt;id&gt;0&lt;/id&gt;            
					&lt;text&gt;32 IRVING&lt;/text&gt;          
			&lt;/answer&gt;          
			&lt;answer&gt;           
					 &lt;id&gt;1&lt;/id&gt;            
					 &lt;text&gt;16604 102A&lt;/text&gt;          
			 &lt;/answer&gt;          
			 &lt;answer&gt;            
					 &lt;id&gt;2&lt;/id&gt;            
					 &lt;text&gt;NONE OF THE ABOVE&lt;/text&gt;          
			 &lt;/answer&gt;        
		&lt;/possibleAnswers&gt;
	&lt;/question&gt;
	&lt;question&gt;
		&lt;id&gt;151&lt;/id&gt;
		&lt;text&gt;IN 2013, YOU LIVED IN WHICH OF THE FOLLOWING CITIES?&lt;/text&gt;
		&lt;state&gt;un-scored&lt;/state&gt;
		&lt;maxTimeToAnswer&gt;120&lt;/maxTimeToAnswer&gt;
		&lt;answerId&gt;1&lt;/answerId&gt;
	    &lt;possibleAnswers&gt;          
		  &lt;answer&gt;            
				   &lt;id&gt;0&lt;/id&gt;            
				  &lt;text&gt;GODERICH&lt;/text&gt;          
		  &lt;/answer&gt;          
		  &lt;answer&gt;            
				   &lt;id&gt;1&lt;/id&gt;            
					 &lt;text&gt;WELLAND&lt;/text&gt;          
			 &lt;/answer&gt;          
			 &lt;answer&gt;            
					 &lt;id&gt;2&lt;/id&gt;            
					 &lt;text&gt;NONE OF THE ABOVE&lt;/text&gt;          
			 &lt;/answer&gt;        
	    &lt;/possibleAnswers&gt;
	&lt;/question&gt;
&lt;/questions&gt;
&lt;/identityExam&gt;
&lt;/WebICScoreIdentityExamRequest&gt;
	    </RequestBody>
	</p282:RequestBody>
    </soapenv:Body>
</soapenv:Envelope>


--Scoring Response
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <p309:MessageHeader xmlns:p309="http://www.ctc.ctfs.channel.com/WebICGateway/">
         <messageHeader>
            <secureContentFlag>1</secureContentFlag>
            <messageType>TU_AUTHENTICATION_EXAM_IDENTITY</messageType>
            <responseMode>Synchronous</responseMode>
            <messageId>1</messageId>
            <correlationId>1234</correlationId>
         </messageHeader>
      </p309:MessageHeader>
   </soapenv:Header>
   <soapenv:Body>
      <p309:ResponseBody xmlns:p309="http://www.ctc.ctfs.channel.com/WebICGateway/">
         <ResponseBody>
            <requestStatus>Success</requestStatus>
            <resultDocument><![CDATA[<?xml version="1.0" encoding="UTF-8"?> 
<WebICScoreIdentityExamResponse>
    <identityExam>
        <externalId>1377100642043</externalId>
        <sessionId>1224615</sessionId>
        <score>33.33333</score>
        <decision>FAILED</decision>
        <earnPoints>20</earnPoints>
        <possiblePoints>20</possiblePoints>
    </identityExam>
</WebICScoreIdentityExamResponse>]]></resultDocument>
         </ResponseBody>
      </p309:ResponseBody>
   </soapenv:Body>
</soapenv:Envelope>